import styles from '../styles/guide.module.css';

export default function Guide() {
    return (
        <div className={styles.container}>
            <h2>Βασικές εντολές στην sql</h2>
            <p>Η δήλωση SELECT στη SQL (Structured Query Language) χρησιμοποιείται για να ανακτήσει δεδομένα από μια βάση δεδομένων. Είναι μια από τις πιο σημαντικές δηλώσεις στην SQL και σας επιτρέπει να επιλέξετε ένα ή περισσότερα πεδία από μια πίνακα (ή πίνακες) και να ανακτήσετε τα δεδομένα που πληρούν συγκεκριμένες συνθήκες.</p>
            <span></span>

            <h2>Η συντακτική δομή της SELECT είναι η εξής:</h2>
            <p>SELECT column1, column2, ... FROM table_name WHERE condition;</p>
            <p>Όπου: <br></ br> column1, column2, ... αναπαριστούν τα πεδία που θέλετε να ανακτήσετε από τον πίνακα.table_name είναι ο πίνακας από τον οποίο θέλετε να ανακτήσετε τα δεδομένα.condition είναι μια προαιρετική συνθήκη που περιορίζει τα δεδομένα που ανακτώνται. Αυτή η συνθήκη μπορεί να περιέχει τη δήλωση WHERE που ορίζει τις προϋποθέσεις για την ανάκτηση των δεδομένων.</p>

            <h2>Παράδειγμα άσκησης:</h2>
            <p>Αν θέλετε να ανακτήσετε όλα τα ονόματα όλων των πελατών από έναν πίνακα “Customers” η SQL εντολή θα είναι κάπως έτσι: SELECT first_name, last_name FROM Customers; <br></br> Αυτή η εντολή θα ανακτούσε τα πεδία "first_name" και "last_name" από τον πίνακα "Customers" χωρίς να εφαρμόσει κάποια συνθήκη, επομένως θα επιστρέψει όλες τις εγγραφές από αυτόν τον πίνακα.</p>
            <h3>ΑΣΚΗΣΕΙΣ</h3>
            <p>Για την δική σας εξάσκηση έχουμε δημιουργήσει εξ’ αρχής έναν πίνακα με τους υπαλλήλους μίας εταιρείας ώστε να μπορέσετε να  εξασκηθείτε στην εντολή SELECT. Ο πίνακας αυτός περιέχει με σειρά τις ακόλουθες στήλες: ID, Onoma, Epitheto, Misthodosia. Στον πίνακα αυτό: <br></br> <br></br>
                1. Δοκιμάστε να ενώσετε τα κατάλληλα block ώστε να εμφανίσετε όλα τα στοιχεία του πίνακα Ipalliloi χρησιμοποιώντας την εντολή SELECT * FROM Ypalliloi . <br></br>
                2. Δοκιμάστε, έχοντας κατανοήσει την βασική δομή της εντολής SELECT να εμφανίσετε τα στοιχεία του υπαλλήλου με id = 4. <br></br>
                3. Δοκιμάστε να εμφανίσετε την στήλη της μισθοδοσίας όλων των υπαλλήλων στον πίνακα Ypalliloi και στην συνέχεια να εμφανίσετε μία-μία όλες τις στήλες του πίνακα αυτού. <br></br>
                4.Δοκιμάστε να εμφανίσετε ΜΟΝΟ τα ονόματα και τα επίθετα των υπαλλήλων που είναι εγγεγραμμένοι στον πίνακα Ypalliloi. <br></br>
</p>
        </div>
    )
}